test_cases/3d/aero_5h_3d/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | SeedFOAM Hybrid 3D case generator
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (0 0 0);
boundaryField
{
    inlet
    {
        type            fixedProfile;
        profile         table (
    (0.00000 (0.13810 0 0))
    (0.05000 (0.42583 0 0))
    (0.10000 (0.48282 0 0))
    (0.15000 (0.51963 0 0))
    (0.20000 (0.54743 0 0))
    (0.25000 (0.57002 0 0))
    (0.30000 (0.58916 0 0))
    (0.35000 (0.60585 0 0))
    (0.40000 (0.62069 0 0))
    (0.45000 (0.63408 0 0))
    (0.50000 (0.64630 0 0))
    (0.55000 (0.65756 0 0))
    (0.60000 (0.66801 0 0))
    (0.65000 (0.67777 0 0))
    (0.70000 (0.68693 0 0))
    (0.75000 (0.69557 0 0))
    (0.80000 (0.70375 0 0))
    (0.85000 (0.71152 0 0))
    (0.90000 (0.71893 0 0))
    (0.95000 (0.72601 0 0))
    (1.00000 (0.73279 0 0))
    (1.05000 (0.73930 0 0))
    (1.10000 (0.74555 0 0))
    (1.15000 (0.75158 0 0))
    (1.20000 (0.75740 0 0))
    (1.25000 (0.76302 0 0))
    (1.30000 (0.76847 0 0))
    (1.35000 (0.77374 0 0))
    (1.40000 (0.77885 0 0))
    (1.45000 (0.78382 0 0))
    (1.50000 (0.78865 0 0))
    (1.55000 (0.79335 0 0))
    (1.60000 (0.79793 0 0))
    (1.65000 (0.80239 0 0))
    (1.70000 (0.80674 0 0))
    (1.75000 (0.81099 0 0))
    (1.80000 (0.81514 0 0))
    (1.85000 (0.81920 0 0))
    (1.90000 (0.82317 0 0))
    (1.95000 (0.82705 0 0))
    (2.00000 (0.83085 0 0))
    (2.05000 (0.83458 0 0))
    (2.10000 (0.83823 0 0))
    (2.15000 (0.84181 0 0))
    (2.20000 (0.84532 0 0))
    (2.25000 (0.84877 0 0))
    (2.30000 (0.85216 0 0))
    (2.35000 (0.85549 0 0))
    (2.40000 (0.85876 0 0))
    (2.45000 (0.86197 0 0))
    (2.50000 (0.86513 0 0))
    (2.55000 (0.86824 0 0))
    (2.60000 (0.87130 0 0))
    (2.65000 (0.87432 0 0))
    (2.70000 (0.87728 0 0))
    (2.75000 (0.88020 0 0))
    (2.80000 (0.88308 0 0))
    (2.85000 (0.88592 0 0))
    (2.90000 (0.88872 0 0))
    (2.95000 (0.89147 0 0))
    (3.00000 (0.89419 0 0))
    (3.05000 (0.89687 0 0))
    (3.10000 (0.89952 0 0))
    (3.15000 (0.90213 0 0))
    (3.20000 (0.90471 0 0))
    (3.25000 (0.90725 0 0))
    (3.30000 (0.90977 0 0))
    (3.35000 (0.91225 0 0))
    (3.40000 (0.91470 0 0))
    (3.45000 (0.91712 0 0))
    (3.50000 (0.91952 0 0))
    (3.55000 (0.92189 0 0))
    (3.60000 (0.92422 0 0))
    (3.65000 (0.92654 0 0))
    (3.70000 (0.92882 0 0))
    (3.75000 (0.93109 0 0))
    (3.80000 (0.93332 0 0))
    (3.85000 (0.93554 0 0))
    (3.90000 (0.93773 0 0))
    (3.95000 (0.93989 0 0))
    (4.00000 (0.94204 0 0))
    (4.05000 (0.94416 0 0))
    (4.10000 (0.94626 0 0))
    (4.15000 (0.94834 0 0))
    (4.20000 (0.95040 0 0))
    (4.25000 (0.95244 0 0))
    (4.30000 (0.95446 0 0))
    (4.35000 (0.95647 0 0))
    (4.40000 (0.95845 0 0))
    (4.45000 (0.96041 0 0))
    (4.50000 (0.96236 0 0))
    (4.55000 (0.96429 0 0))
    (4.60000 (0.96620 0 0))
    (4.65000 (0.96809 0 0))
    (4.70000 (0.96997 0 0))
    (4.75000 (0.97183 0 0))
    (4.80000 (0.97368 0 0))
    (4.85000 (0.97551 0 0))
    (4.90000 (0.97732 0 0))
    (4.95000 (0.97912 0 0))
    (5.00000 (0.98091 0 0))
    (5.05000 (0.98268 0 0))
    (5.10000 (0.98443 0 0))
    (5.15000 (0.98618 0 0))
    (5.20000 (0.98790 0 0))
    (5.25000 (0.98962 0 0))
    (5.30000 (0.99132 0 0))
    (5.35000 (0.99301 0 0))
    (5.40000 (0.99468 0 0))
    (5.45000 (0.99634 0 0))
    (5.50000 (0.99799 0 0))
    (5.55000 (0.99963 0 0))
    (5.60000 (1.00126 0 0))
    (5.65000 (1.00287 0 0))
    (5.70000 (1.00447 0 0))
    (5.75000 (1.00607 0 0))
    (5.80000 (1.00764 0 0))
    (5.85000 (1.00921 0 0))
    (5.90000 (1.01077 0 0))
    (5.95000 (1.01232 0 0))
    (6.00000 (1.01385 0 0))
    (6.05000 (1.01538 0 0))
    (6.10000 (1.01689 0 0))
    (6.15000 (1.01840 0 0))
    (6.20000 (1.01989 0 0))
    (6.25000 (1.02138 0 0))
    (6.30000 (1.02286 0 0))
    (6.35000 (1.02432 0 0))
    (6.40000 (1.02578 0 0))
    (6.45000 (1.02723 0 0))
    (6.50000 (1.02866 0 0))
    (6.55000 (1.03009 0 0))
    (6.60000 (1.03151 0 0))
    (6.65000 (1.03293 0 0))
    (6.70000 (1.03433 0 0))
    (6.75000 (1.03572 0 0))
    (6.80000 (1.03711 0 0))
    (6.85000 (1.03849 0 0))
    (6.90000 (1.03986 0 0))
    (6.95000 (1.04122 0 0))
    (7.00000 (1.04257 0 0))
    (7.05000 (1.04392 0 0))
    (7.10000 (1.04525 0 0))
    (7.15000 (1.04658 0 0))
    (7.20000 (1.04791 0 0))
    (7.25000 (1.04922 0 0))
    (7.30000 (1.05053 0 0))
    (7.35000 (1.05183 0 0))
    (7.40000 (1.05312 0 0))
    (7.45000 (1.05441 0 0))
    (7.50000 (1.05569 0 0))
    (7.55000 (1.05696 0 0))
    (7.60000 (1.05822 0 0))
    (7.65000 (1.05948 0 0))
    (7.70000 (1.06073 0 0))
    (7.75000 (1.06198 0 0))
    (7.80000 (1.06321 0 0))
    (7.85000 (1.06445 0 0))
    (7.90000 (1.06567 0 0))
    (7.95000 (1.06689 0 0))
    (8.00000 (1.06810 0 0))
    (8.05000 (1.06931 0 0))
    (8.10000 (1.07051 0 0))
    (8.15000 (1.07170 0 0))
    (8.20000 (1.07289 0 0))
    (8.25000 (1.07408 0 0))
    (8.30000 (1.07525 0 0))
    (8.35000 (1.07642 0 0))
    (8.40000 (1.07759 0 0))
    (8.45000 (1.07875 0 0))
    (8.50000 (1.07990 0 0))
    (8.55000 (1.08105 0 0))
    (8.60000 (1.08219 0 0))
    (8.65000 (1.08333 0 0))
    (8.70000 (1.08446 0 0))
    (8.75000 (1.08559 0 0))
    (8.80000 (1.08671 0 0))
    (8.85000 (1.08783 0 0))
    (8.90000 (1.08894 0 0))
    (8.95000 (1.09004 0 0))
    (9.00000 (1.09114 0 0))
    (9.05000 (1.09224 0 0))
    (9.10000 (1.09333 0 0))
    (9.15000 (1.09442 0 0))
    (9.20000 (1.09550 0 0))
    (9.25000 (1.09657 0 0))
    (9.30000 (1.09765 0 0))
    (9.35000 (1.09871 0 0))
    (9.40000 (1.09977 0 0))
    (9.45000 (1.10083 0 0))
    (9.50000 (1.10189 0 0))
    (9.55000 (1.10293 0 0))
    (9.60000 (1.10398 0 0))
    (9.65000 (1.10502 0 0))
    (9.70000 (1.10605 0 0))
    (9.75000 (1.10708 0 0))
    (9.80000 (1.10811 0 0))
    (9.85000 (1.10913 0 0))
);
        direction       (0 0 1);
        origin          0;
    }
    outlet    { type inletOutlet; inletValue uniform (0 0 0); value uniform (0 0 0); }
    ground    { type noSlip; }
    buildings { type noSlip; }
    top       { type slip; }
    sides     { type symmetry; }
}

// ************************************************************************* //
